{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.2,
  "hidden_size": 256,
  "id2label": {
    "0": "POS-0",
    "1": "POS-1",
    "2": "POS-2",
    "3": "POS-3",
    "4": "POS-4",
    "5": "POS-5",
    "6": "POS-6",
    "7": "POS-7",
    "8": "POS-8",
    "9": "POS-9",
    "10": "POS-10",
    "11": "POS-11",
    "12": "POS-12",
    "13": "POS-13",
    "14": "POS-14",
    "15": "POS-15",
    "16": "POS-16",
    "17": "POS-17",
    "18": "POS-18",
    "19": "POS-19",
    "20": "POS-20",
    "21": "POS-21",
    "22": "POS-22",
    "23": "POS-23",
    "24": "POS-24",
    "25": "POS-25",
    "26": "POS-26",
    "27": "POS-27",
    "28": "POS-28",
    "29": "POS-29",
    "30": "POS-30",
    "31": "POS-31",
    "32": "POS-32",
    "33": "POS-33",
    "34": "POS-34",
    "35": "POS-35",
    "36": "POS-36",
    "37": "POS-37",
    "38": "POS-38",
    "39": "POS-39",
    "40": "POS-40",
    "41": "POS-41",
    "42": "POS-42",
    "43": "POS-43",
    "44": "POS-44",
    "45": "POS-45",
    "46": "POS-46",
    "47": "POS-47",
    "48": "POS-48",
    "49": "POS-49",
    "50": "POS-50",
    "51": "POS-51",
    "52": "POS-52",
    "53": "POS-53",
    "54": "POS-54",
    "55": "POS-55",
    "56": "POS-56",
    "57": "POS-57",
    "58": "POS-58",
    "59": "POS-59"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "POS-0": 0,
    "POS-1": 1,
    "POS-10": 10,
    "POS-11": 11,
    "POS-12": 12,
    "POS-13": 13,
    "POS-14": 14,
    "POS-15": 15,
    "POS-16": 16,
    "POS-17": 17,
    "POS-18": 18,
    "POS-19": 19,
    "POS-2": 2,
    "POS-20": 20,
    "POS-21": 21,
    "POS-22": 22,
    "POS-23": 23,
    "POS-24": 24,
    "POS-25": 25,
    "POS-26": 26,
    "POS-27": 27,
    "POS-28": 28,
    "POS-29": 29,
    "POS-3": 3,
    "POS-30": 30,
    "POS-31": 31,
    "POS-32": 32,
    "POS-33": 33,
    "POS-34": 34,
    "POS-35": 35,
    "POS-36": 36,
    "POS-37": 37,
    "POS-38": 38,
    "POS-39": 39,
    "POS-4": 4,
    "POS-40": 40,
    "POS-41": 41,
    "POS-42": 42,
    "POS-43": 43,
    "POS-44": 44,
    "POS-45": 45,
    "POS-46": 46,
    "POS-47": 47,
    "POS-48": 48,
    "POS-49": 49,
    "POS-5": 5,
    "POS-50": 50,
    "POS-51": 51,
    "POS-52": 52,
    "POS-53": 53,
    "POS-54": 54,
    "POS-55": 55,
    "POS-56": 56,
    "POS-57": 57,
    "POS-58": 58,
    "POS-59": 59,
    "POS-6": 6,
    "POS-7": 7,
    "POS-8": 8,
    "POS-9": 9
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 60,
  "max_relative_positions": 60,
  "model_type": "deberta-v2",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 256,
  "pos_att_type": null,
  "position_biased_input": true,
  "relative_attention": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 0,
  "vocab_size": 41
}
